#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.allow_db_access_sg will be created
  + resource "aws_security_group" "allow_db_access_sg" {
      + arn                    = (known after apply)
      + description            = "Allow DB access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                  + "10.0.3.0/24",
                ]
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "allow_db_access_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.fargate_container_sg will be created
  + resource "aws_security_group" "fargate_container_sg" {
      + arn                    = (known after apply)
      + description            = "Allow access to the public facing load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Ingress from the public ALB"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress from other containers in the same security group"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress from the private ALB"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # random_password.db_password will be created
  + resource "random_password" "db_password" {
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "_%@{}<>"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.alb_public.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "symbiosis-alb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name" = "symbiosis-alb"
        }
      + tags_all                   = {
          + "Name"                 = "symbiosis-alb"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb_public.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb_public.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "pref-"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "pref-"
        }
      + tags_all                           = {
          + "Name"                 = "pref-"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.fargate.aws_appautoscaling_policy.ecs_policy_scale_down will be created
  + resource "aws_appautoscaling_policy" "ecs_policy_scale_down" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "scale-down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/symbiosis-fargate-dev/symbiosis-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # module.fargate.aws_appautoscaling_policy.ecs_policy_scale_up will be created
  + resource "aws_appautoscaling_policy" "ecs_policy_scale_up" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "scale-up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/symbiosis-fargate-dev/symbiosis-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "1"
              + scaling_adjustment          = 1
            }
        }
    }

  # module.fargate.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/symbiosis-fargate-dev/symbiosis-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.fargate.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 75
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "symbiosis-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 1
        }

      + load_balancer {
          + container_name   = "symbiosis-service"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.fargate.aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "symbiosis-service"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.fargate.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_task_execution_role"
      + path                  = "/"
      + tags_all              = {
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn         = (known after apply)
      + description = "Database subnet group for symbiosis-vpc"
      + id          = (known after apply)
      + name        = "symbiosis-vpc"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "symbiosis-vpc"
        }
      + tags_all    = {
          + "Name"                 = "symbiosis-vpc"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1a"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1a"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1b"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1b"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1c"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1c"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "symbiosis-vpc"
        }
      + tags_all = {
          + "Name"                 = "symbiosis-vpc"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1a"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1a"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1b"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1b"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1c"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1c"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "symbiosis-vpc-private-ap-southeast-1a"
        }
      + tags_all         = {
          + "Name"                 = "symbiosis-vpc-private-ap-southeast-1a"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "symbiosis-vpc-private-ap-southeast-1b"
        }
      + tags_all         = {
          + "Name"                 = "symbiosis-vpc-private-ap-southeast-1b"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "symbiosis-vpc-private-ap-southeast-1c"
        }
      + tags_all         = {
          + "Name"                 = "symbiosis-vpc-private-ap-southeast-1c"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "symbiosis-vpc-public"
        }
      + tags_all         = {
          + "Name"                 = "symbiosis-vpc-public"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.51.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "symbiosis-vpc-db-ap-southeast-1a"
        }
      + tags_all                        = {
          + "Name"                 = "symbiosis-vpc-db-ap-southeast-1a"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.52.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "symbiosis-vpc-db-ap-southeast-1b"
        }
      + tags_all                        = {
          + "Name"                 = "symbiosis-vpc-db-ap-southeast-1b"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.53.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "symbiosis-vpc-db-ap-southeast-1c"
        }
      + tags_all                        = {
          + "Name"                 = "symbiosis-vpc-db-ap-southeast-1c"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "symbiosis-vpc-private-ap-southeast-1a"
        }
      + tags_all                        = {
          + "Name"                 = "symbiosis-vpc-private-ap-southeast-1a"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "symbiosis-vpc-private-ap-southeast-1b"
        }
      + tags_all                        = {
          + "Name"                 = "symbiosis-vpc-private-ap-southeast-1b"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "symbiosis-vpc-private-ap-southeast-1c"
        }
      + tags_all                        = {
          + "Name"                 = "symbiosis-vpc-private-ap-southeast-1c"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.101.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "symbiosis-vpc-public-ap-southeast-1a"
        }
      + tags_all                        = {
          + "Name"                 = "symbiosis-vpc-public-ap-southeast-1a"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.102.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "symbiosis-vpc-public-ap-southeast-1b"
        }
      + tags_all                        = {
          + "Name"                 = "symbiosis-vpc-public-ap-southeast-1b"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.103.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "symbiosis-vpc-public-ap-southeast-1c"
        }
      + tags_all                        = {
          + "Name"                 = "symbiosis-vpc-public-ap-southeast-1c"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "symbiosis-vpc"
        }
      + tags_all                         = {
          + "Name"                 = "symbiosis-vpc"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.fargate.module.ecs_cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + id                 = (known after apply)
      + name               = "symbiosis-fargate-dev"
      + tags_all           = {
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }

      + default_capacity_provider_strategy {
          + capacity_provider = "FARGATE_SPOT"
        }

      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.symbosis_my_sql_db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "symbiosis-vpc"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7.34"
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "symbiosisdb-dev"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = "symbiosisdb"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "symbiosisdb-dev"
        }
      + tags_all                              = {
          + "Name"                 = "symbiosisdb-dev"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + timezone                              = (known after apply)
      + username                              = "symbiosis"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {
          + create = "40m"
          + delete = "40m"
          + update = "80m"
        }
    }

  # module.symbosis_my_sql_db.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "symbiosisdb-dev"
        }
    }

  # module.symbosis_my_sql_db.module.db_option_group.aws_db_option_group.this[0] will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "5.7"
      + name                     = (known after apply)
      + name_prefix              = "symbiosisdb-dev-"
      + option_group_description = "symbiosisdb-dev option group"
      + tags                     = {
          + "Name" = "symbiosisdb-dev"
        }
      + tags_all                 = {
          + "Name"                 = "symbiosisdb-dev"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }

      + timeouts {
          + delete = "15m"
        }
    }

  # module.symbosis_my_sql_db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "symbiosisdb-dev parameter group"
      + family      = "mysql5.7"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "symbiosisdb-dev-"
      + tags        = {
          + "Name" = "symbiosisdb-dev"
        }
      + tags_all    = {
          + "Name"                 = "symbiosisdb-dev"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
    }

Plan: 52 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @logamanig, Action: `pull_request`, Working Directory: `./challenge1`, Workflow: `Terraform Plan - Dev`*